import { HoverEffect } from "../ui/card-hover-effect";

export function CardHoverEffect() {
  return (
    <div className="max-w-5xl mx-auto px-8">
      <HoverEffect items={projects} />
    </div>
  );
}
export const projects = [
  {
    title: "ทุนน้อย!!",
    description:
      "ลงทุนน้อยกว่าการเป็นผู้ผลิตเอง ไม่ต้องใช้เงินก้อน ความเสี่ยงน้อยกว่า.",
    link: "มาดามเฮง",
  },
  {
    title: "ไม่เสียเวลา!!",
    description:
      "ไม่ต้องมีความรู้เฉพาะทางด้านการผลิต ขายได้เลยไม่เสียเวลา ขนส่งไว มีความยืดหยุ่นในการทำงาน มีสินค้าหลากหลายให้เลือก.",
    link: "มาดามเฮง",
  },
  {
    title: "สินค้าคุณภาพ!!",
    description:
      "สินค้ามีคุณภาพ มีมานานกว่า10ปี",
    link: "มาดามเฮง",
  },
  {
    title: "เชื่อถือได้!!",
    description:
      "บริษัทเรามีความน่าเชื่อ มีทั้งฐานลูกค้าและประสบการณ์ ได้รับการสนับสนุนจากเจ้าของแบรนด์",
    link: "มาดามเฮง",
  },
  {
    title: "สะดวกสบาย!!",
    description:
      "ไม่ต้องผลิตเอง ต้นทุนน้อยลง ไม่ต้องจัดหาสินค้า สะดวกสบายในการขาย สินค้าถึงมือลูกค้าเร็ว",
    link: "มาดามเฮง",
  },
  {
    title: "การันตีคุณภาพของสินค้า!!",
    description:
      "บริษัทเราการันตีคุณภาพสินค้า และการขนส่งให้แก่ตัวแทนจำหน่าย ไม่ต้องกังวลเรื่องสินค้าเสียหายก่อนถึงมือ",
    link: "มาดามเฮง",
  },
];
